Catalogs/ПодпискиНаРассылкиИОповещенияКлиентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ПодпискиНаРассылкиИОповещенияКлиентам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Партнеры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаРассылокИОповещений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыРассылокИОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьПартнеру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИПартнераДляПисем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИПартнераДляSMS</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьКонтактномуЛицуОбъектаОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИКонтактногоЛицаОбъектаОповещенияДляПисем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИКонтактногоЛицаОбъектаОповещенияДляSMS</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодпискаДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКонтактныхЛицАдресатов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКИДляПисем</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКИДляSMS</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПодпискиНаРассылкиИОповещенияКлиентам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ОтправлятьПартнеру Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИПартнераДляПисем");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИПартнераДляSMS");

	КонецЕсли;
	
	Если Не ОтправлятьКонтактномуЛицуОбъектаОповещения Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИКонтактногоЛицаОбъектаОповещенияДляПисем");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИКонтактногоЛицаОбъектаОповещенияДляSMS");
		
	КонецЕсли;
	
	РеквизитыГруппы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГруппаРассылокИОповещений,
	                                                              "ПредназначенаДляЭлектронныхПисем, ПредназначенаДляSMS");
	
	Если НЕ РеквизитыГруппы.ПредназначенаДляЭлектронныхПисем Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИКонтактногоЛицаОбъектаОповещенияДляПисем");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИПартнераДляПисем");
		МассивНепроверяемыхРеквизитов.Добавить("КонтактныеЛица.ВидКИДляПисем");
		
	КонецЕсли;
	
	Если НЕ РеквизитыГруппы.ПредназначенаДляSMS Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИКонтактногоЛицаОбъектаОповещенияДляSMS");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИПартнераДляSMS");
		МассивНепроверяемыхРеквизитов.Добавить("КонтактныеЛица.ВидКИДляSMS");
		
	КонецЕсли;
	
	Если ПодпискаДействует И (Не ОтправлятьПартнеру И НЕ ОтправлятьКонтактномуЛицуОбъектаОповещения И КонтактныеЛица.Количество() = 0) Тогда
		
		ТекстОшибки = НСтр("ru = 'Подписка действует, но не указан ни один адресат.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ОтправлятьПартнеру",
			,
			Отказ);
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	КоличествоКонтактныхЛицАдресатов = КонтактныеЛица.Количество();
	ШаблонНаименования = НСтр("ru = 'Для ""%1"" по ""%2""'");
	ШаблонНаименования = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования,
	                                                                       Строка(Владелец),
	                                                                       Строка(ГруппаРассылокИОповещений));
	
	Если СтрДлина(ШаблонНаименования) > 150 Тогда
		Наименование = Лев(ШаблонНаименования, 147) + "...";
	Иначе
		Наименование = ШаблонНаименования;
	КонецЕсли;
	
	КонтактныеЛица.Свернуть("КонтактноеЛицо, ВидКИДляПисем, ВидКИДляSMS");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
